In [4]:
import pandas as pd
import numpy as np

#  create Series

In [5]:
labels=['a','b','c','d']
my_data=[10,20,30,40]
arr=np.array(my_data)
d={'ed':50,'f':60,'g':70,'h':80}

In [6]:
pd.Series(data=my_data)

0    10
1    20
2    30
3    40
dtype: int64

In [7]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
d    40
dtype: int64

In [8]:
pd.Series(d)

ed    50
f     60
g     70
h     80
dtype: int64

In [9]:
pd.Series(arr,labels)

a    10
b    20
c    30
d    40
dtype: int32

In [10]:
from numpy.random import randn

In [11]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.164902  0.997786 -0.165481  0.770360
B -0.104474  2.039237 -1.044165 -0.758606
C -0.613901  0.393674 -0.180847  0.186067
D -0.202179  1.235778 -0.727607  1.262566
E  2.401704  0.601318 -1.272905  0.969919

In [12]:
#Create new column in dataframe

df['New']=df['W']+df['Y']
df

          W         X         Y         Z       New
A  0.164902  0.997786 -0.165481  0.770360 -0.000579
B -0.104474  2.039237 -1.044165 -0.758606 -1.148639
C -0.613901  0.393674 -0.180847  0.186067 -0.794747
D -0.202179  1.235778 -0.727607  1.262566 -0.929786
E  2.401704  0.601318 -1.272905  0.969919  1.128799

In [13]:
#drop column temporarily


df.drop('New',axis=1)

          W         X         Y         Z
A  0.164902  0.997786 -0.165481  0.770360
B -0.104474  2.039237 -1.044165 -0.758606
C -0.613901  0.393674 -0.180847  0.186067
D -0.202179  1.235778 -0.727607  1.262566
E  2.401704  0.601318 -1.272905  0.969919

In [14]:
df

          W         X         Y         Z       New
A  0.164902  0.997786 -0.165481  0.770360 -0.000579
B -0.104474  2.039237 -1.044165 -0.758606 -1.148639
C -0.613901  0.393674 -0.180847  0.186067 -0.794747
D -0.202179  1.235778 -0.727607  1.262566 -0.929786
E  2.401704  0.601318 -1.272905  0.969919  1.128799

In [15]:
# drop column permanently

df.drop('New',axis=1,inplace=True)

In [16]:
df

          W         X         Y         Z
A  0.164902  0.997786 -0.165481  0.770360
B -0.104474  2.039237 -1.044165 -0.758606
C -0.613901  0.393674 -0.180847  0.186067
D -0.202179  1.235778 -0.727607  1.262566
E  2.401704  0.601318 -1.272905  0.969919

In [17]:
#drop row


df.drop('E',axis=0)

          W         X         Y         Z
A  0.164902  0.997786 -0.165481  0.770360
B -0.104474  2.039237 -1.044165 -0.758606
C -0.613901  0.393674 -0.180847  0.186067
D -0.202179  1.235778 -0.727607  1.262566

In [18]:
df

          W         X         Y         Z
A  0.164902  0.997786 -0.165481  0.770360
B -0.104474  2.039237 -1.044165 -0.758606
C -0.613901  0.393674 -0.180847  0.186067
D -0.202179  1.235778 -0.727607  1.262566
E  2.401704  0.601318 -1.272905  0.969919

In [19]:
#access row in column based


df.loc['B']

W   -0.104474
X    2.039237
Y   -1.044165
Z   -0.758606
Name: B, dtype: float64

In [20]:
df.iloc[1]

W   -0.104474
X    2.039237
Y   -1.044165
Z   -0.758606
Name: B, dtype: float64

In [21]:
# writing different conditions

df[df['Z']>0]['Z']

A    0.770360
C    0.186067
D    1.262566
E    0.969919
Name: Z, dtype: float64

In [22]:
df[(df['W']>0)&(df['Z']<0)][['W','Z']]

Empty DataFrame
Columns: [W, Z]
Index: []

In [23]:
#null,nan


a={'A':[1,2,np.nan],
  'B':[3,np.nan,np.nan],
  'C':[1,2,3]}
a

{'A': [1, 2, nan], 'B': [3, nan, nan], 'C': [1, 2, 3]}

In [25]:
df=pd.DataFrame(a)
df

     A    B  C
0  1.0  3.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [26]:
#deleting nulls

df.dropna()

     A    B  C
0  1.0  3.0  1

In [27]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [28]:
df.dropna(axis=0)

     A    B  C
0  1.0  3.0  1

drop is axis=1(columns)
drop is axis=0(row)

In [32]:
#goupby


data={'company':['GOOG','GOOG','FB','FB','TW','TW','GOOG','TW','FB'],
     'sales':[200,300,150,400,450,500,550,600,650]}
data

{'company': ['GOOG', 'GOOG', 'FB', 'FB', 'TW', 'TW', 'GOOG', 'TW', 'FB'],
 'sales': [200, 300, 150, 400, 450, 500, 550, 600, 650]}

In [33]:
df2=pd.DataFrame(data)
df2

  company  sales
0    GOOG    200
1    GOOG    300
2      FB    150
3      FB    400
4      TW    450
5      TW    500
6    GOOG    550
7      TW    600
8      FB    650

In [34]:
bycomp=df2.groupby('company')
bycomp

In [36]:
bycomp.mean()

              sales
company
FB       400.000000
GOOG     350.000000
TW       516.666667

In [37]:
bycomp.sum()

         sales
company
FB        1200
GOOG      1050
TW        1550

In [39]:
bycomp.sum().loc['GOOG']

sales    1050
Name: GOOG, dtype: int64

In [40]:
df2.groupby('company').max()

         sales
company
FB         650
GOOG       550
TW         600

In [41]:
df2.groupby('company').min()

         sales
company
FB         150
GOOG       200
TW         450

In [42]:
bycomp.std()

              sales
company
FB       250.000000
GOOG     180.277564
TW        76.376262

In [43]:
bycomp.describe()

        sales
        count        mean         std    min    25%    50%    75%    max
company
FB        3.0  400.000000  250.000000  150.0  275.0  400.0  525.0  650.0
GOOG      3.0  350.000000  180.277564  200.0  250.0  300.0  425.0  550.0
TW        3.0  516.666667   76.376262  450.0  475.0  500.0  550.0  600.0

In [44]:
#concat


df1 = pd.DataFrame({"A":["A0","A1","A2","A3"],
                   "B":["B0","B1","B2","B3"],
                   "C":["C0","C1","C2","C3"],
                   "D":["D0","D1","D2","D3"]})
df2 = pd.DataFrame({"A":["A4","A5","A6","A7"],
                   "B":["B4","B5","B6","B7"],
                   "C":["C4","C5","C6","C7"],
                   "D":["D4","D5","D6","D7"]})
df3 = pd.DataFrame({"A":["A8","A9","A10","A11"],
                   "B":["B8","B9","B10","B11"],
                   "C":["C8","C9","C10","C11"],
                   "D":["D8","D9","D10","D11"]})

In [45]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [46]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [47]:
df3

     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [48]:
pd.concat([df1,df2,df3])

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [49]:
pd.concat([df1,df2,df3],axis=1)

    A   B   C   D   A   B   C   D    A    B    C    D
0  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  A7  B7  C7  D7  A11  B11  C11  D11

In [50]:
# merge


left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    "A":["A0","A1","A2","A3"],
                   "B":["B0","B1","B2","B3"]})
right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                      "C":["C0","C1","C2","C3"],
                   "D":["D0","D1","D2","D3"]})

In [51]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [52]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [53]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [54]:
pd.merge(df1,df2,how='inner')

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [55]:
pd.merge(df1,df2,how='outer')

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7